title: Remote Management and Monitoring tool - DameWare
id: 8810383c-e8aa-43b2-ae9d-ae8b41d1267b
status: experimental
description: |
    Remote Monitoring and Management (RMM) software programs and services are often used by Enterprise and SMB IT to provide management and monitoring of remote endpoints.
    Attackers have also begun to abuse these programs and services as means to maintain persistance or provide fall back command and control channels. A number of threat groups with varied and diverse goals, have been observed using RMM products to achieve missons of espionage, data theft, and ransomware.
author: JiSchell-MSFT
date: 2023/10/27
tags:
    - attack.command_and_control
    - attack.t1219
logsource:
    category: process_creation
    product: windows
detection:
    company_var1:
        - Company|contains: 'DameWare'
    company_var2:
        - Company|contains: 'SolarWinds'
    info_product_var1:
        - Product|contains: 'DameWare'
    info_description_var1:
        - Description|contains: 'DameWare'
    condition: 1 of company_* and 1 of info_*
falsepositives:
    - Legitimate use of the RMM tool DameWare
level: high