title: Remote Management and Monitoring tool - ConnectWise
id: 75c72a05-f008-42df-8e10-7120587a66e0
status: experimental
description: |
    Remote Monitoring and Management (RMM) software programs and services are often used by Enterprise and SMB IT to provide management and monitoring of remote endpoints.
    Attackers have also begun to abuse these programs and services as means to maintain persistance or provide fall back command and control channels. A number of threat groups with varied and diverse goals, have been observed using RMM products to achieve missons of espionage, data theft, and ransomware.
author: JiSchell-MSFT
date: 2023/10/27
tags:
    - attack.command_and_control
    - attack.t1219
logsource:
    category: process_creation
    product: windows
detection:
    company_var1:
        - Company|contains: 'ConnectWise'
    company_var2:
        - Company|contains: 'Continuum Managed'
    company_var3:
        - Company|contains: 'ScreenConnect'
    condition: 1 of company_*
falsepositives:
    - Legitimate use of the RMM tool ConnectWise
level: high