id: 99cd2519-9bdd-482d-aa8a-fbd8894476e3
name: Remote Management and Monitoring tool - DWService - Create Process
description: |
    Remote Monitoring and Management (RMM) programs are IT to manage remote endpoints. Attackers have begun to abuse these programs to persist or provide C2 channels.
    https://github.com/jischell-msft/RemoteManagementMonitoringTools
requiredDataConnectors:
    - connectorId: MicrosoftThreatProtection
    dataTypes:
        - DeviceProcessEvents
        - DeviceFileCertificateInfo
tactics: CommandAndControl
relevantTechniques: T1219
query: |
  let Time_start = now(-5d);
  let Time_end = now();
  //
  let rmmInitialFileSet = 
  DeviceFileCertificateInfo
  | where Timestamp between (Time_start..Time_end)
  | where Signer has 'DWSNET OÜ'
  | distinct Sha1
  ;
  DeviceProcessEvents 
  | where Timestamp between (Time_start..Time_end)
  | Sha1 in (rmmInitialFileSet)
  | summarize FirstSeen=min(Timestamp), LastSeen=max(Timestamp), 
      Report=make_set(ReportId), Count=count() by DeviceId, DeviceName, AccountUpn 
