id: 98c6b5df-942e-40a4-8dcb-b73e3eaaf429
name: Remote Management and Monitoring tool - RAdmin - Network Connection
description: |
    Remote Monitoring and Management (RMM) programs are IT to manage remote endpoints. Attackers have begun to abuse these programs to persist or provide C2 channels.
    https://github.com/jischell-msft/RemoteManagementMonitoringTools
requiredDataConnectors:
    - connectorId: MicrosoftThreatProtection
    dataTypes:
        - DeviceNetworkEvents
tactics: CommandAndControl
relevantTechniques: T1219
query: |
  let Time_start = now(-5d);
  let Time_end = now();
  //
  DeviceNetworkEvents
  | where Timestamp between (Time_start..Time_end)
  | where RemoteUrl has_any (
          'activate.famatech.com',
          'radminte.com'
      )
      and InitiatingProcessVersionInfoCompanyName has 'famatech'
  | summarize FirstSeen=min(Timestamp), LastSeen=max(Timestamp), 
      Report=make_set(ReportId), Count=count() by DeviceId, DeviceName,
      AccountUpn, RemoteUrl 
