title: Remote Management and Monitoring tool - AnyViewer
id: f2be3316-8541-44e9-b6bc-5d0ccdab1703
status: experimental
description: |
    Remote Monitoring and Management (RMM) software programs and services are often used by Enterprise and SMB IT to provide management and monitoring of remote endpoints.
    Attackers have also begun to abuse these programs and services as means to maintain persistance or provide fall back command and control channels. A number of threat groups with varied and diverse goals, have been observed using RMM products to achieve missons of espionage, data theft, and ransomware.
author: JiSchell-MSFT
date: 2023/10/27
tags:
    - attack.command_and_control
    - attack.t1219
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Company|contains: 'AOMEI'
        - Product|contains: 'AnyViewer'
    condition: selection
falsepositives:
    - Legitimate use of the RMM tool AnyViewer
level: high