title: Remote Management and Monitoring tool - Action1
    id: fc5a198b-8138-4f99-95fd-138362135786
    status: experimental
    description: |
        Remote Monitoring and Management (RMM) software programs and services are often used by Enterprise and SMB IT to provide management and monitoring of remote endpoints.
        Attackers have also begun to abuse these programs and services as means to maintain persistance or provide fall back command and control channels. A number of threat groups with varied and diverse goals, have been observed using RMM products to achieve missons of espionage, data theft, and ransomware.
    references:
    author: JiSchell-MSFT
    date: 2023/10/27
    tags:
        - attack.command_and_control
        - attack.t1219
    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            - Product|contains: 'Action1'
            - Company|contains: 'Action1'
        condition: selection
    falsepositives:
        - Legitimate use of the RMM tool
    level: high